Curve-Based Family is slightly off axis and may cause inaccuracies.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InaccurateCurveBasedFamily { get; }
  Visual Basic
Public Shared ReadOnly Property InaccurateCurveBasedFamily As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InaccurateCurveBasedFamily {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures InaccurateFailures Class
  Autodesk.Revit.DB Namespace